Revit 2026 API

# StairsRunCreateSketchedRunWithSlopeData Method

---
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static StairsRun CreateSketchedRunWithSlopeData(
	Document document,
	ElementId stairsId,
	double baseElevation,
	IList<SketchedStairsCurveData> boundaryCurves,
	IList<Curve> riserCurves,
	IList<Curve> stairsPath
)
```
```vb
Public Shared Function CreateSketchedRunWithSlopeData (
	document As Document,
	stairsId As ElementId,
	baseElevation As Double,
	boundaryCurves As IList(Of SketchedStairsCurveData),
	riserCurves As IList(Of Curve),
	stairsPath As IList(Of Curve)
) As StairsRun
```
```cpp
public:
static StairsRun^ CreateSketchedRunWithSlopeData(
	Document^ document,
	ElementId^ stairsId,
	double baseElevation,
	IList<SketchedStairsCurveData^>^ boundaryCurves,
	IList<Curve^>^ riserCurves,
	IList<Curve^>^ stairsPath
)
```
```fsharp
static member CreateSketchedRunWithSlopeData :
        document : Document *
        stairsId : ElementId *
        baseElevation : float *
        boundaryCurves : IList<SketchedStairsCurveData> *
        riserCurves : IList<Curve> *
        stairsPath : IList<Curve> -> StairsRun
```

#### Parameters

document Document

stairsId ElementId

baseElevation Double

boundaryCurves IListSketchedStairsCurveData

riserCurves IListCurve

stairsPath IListCurve

#### Return Value

StairsRun

#### Reference

StairsRun Class

Autodesk.Revit.DB.Architecture Namespace